app/views/developers/index.html.haml

    Project count:
    = developer.projects.count
---
SELECT COUNT(*) FROM "projects" WHERE "projects"."developer_id" = $1  [["developer_id", 1]]