app/controllers/developers_controller.rb

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @developer = Developer.find(params[:id])

SELECT "developers".* FROM "developers"
---
  def index
    @developers = Developer.all

INSERT INTO "developers" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Ed"], ["last_name", "Ver"], ["created_at", "2016-11-24 14:01:25.040894"], ["updated_at", "2016-11-24 14:01:25.040894"]]
---
  def create
    @developer = Developer.new(developer_params)

    if @developer.save