app/controllers/projects_controller.rb

  def new
    @developer = Developer.find(params[:developer_id])
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @developer = Developer.find(params[:developer_id])
    @project = @developer.projects.build(project_params)

    if @project.save
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "projects" ("name", "description", "developer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "tester"], ["developer_id", 1], ["created_at", "2016-11-25 13:40:57.470557"], ["updated_at", "2016-11-25 13:40:57.470557"]]